zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Qspi/SpiMaster/IfxQspi_SpiMaster.h
/** \addtogroup IfxLld_Qspi_SpiMaster_DataStructures
 * \{ */
typedef enum
{
    IfxQspi_SpiMaster_ChannelBasedCs_disabled = 0,  /**< \brief Slso will be low for complete frame */
    IfxQspi_SpiMaster_ChannelBasedCs_enabled  = 1   /**< \brief Slso will toggle with every byte */
} IfxQspi_SpiMaster_ChannelBasedCs;

typedef enum
{
    IfxQspi_SpiMaster_Mode_short           = 0,  /**< \brief Short Mode */
    IfxQspi_SpiMaster_Mode_long            = 1,  /**< \brief Long Mode */
    IfxQspi_SpiMaster_Mode_shortContinuous = 2,  /**< \brief Short Continous Mode */
    IfxQspi_SpiMaster_Mode_longContinuous  = 3,  /**< \brief Long Continous Mode */
    IfxQspi_SpiMaster_Mode_xxl             = 4   /**< \brief XXL Mode */
} IfxQspi_SpiMaster_Mode;

/** \} */

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Qspi_SpiMaster_DataStructures
 * \{ */
/** \brief SLSI  pin configuration structure
 */
typedef struct
{
    const IfxQspi_Slsi_In *pin;      /**< \brief Pointer to SLSI in pin */
    IfxPort_InputMode      mode;     /**< \brief The SLSI pin input mode */
} IfxQspi_SpiMaster_Input;

/** \brief SLSO  pin configuration structure
 */
typedef struct
{
    const IfxQspi_Slso_Out *pin;        /**< \brief Pointer to SLSO out pin */
    IfxPort_OutputMode      mode;       /**< \brief The SLSO pin output mode */
    IfxPort_PadDriver       driver;     /**< \brief The pad driver mode which should be configured */
} IfxQspi_SpiMaster_Output;

/** \} */

/** \addtogroup IfxLld_Qspi_SpiMaster_DataStructures
 * \{ */
/** \brief Dma handle
 */
typedef struct
{
    IfxDma_Dma_Channel rxDmaChannel;       /**< \brief receive DMA channel handle */
    IfxDma_Dma_Channel txDmaChannel;       /**< \brief transmit DMA channel handle */
    IfxDma_ChannelId   rxDmaChannelId;     /**< \brief DMA channel no for the Spi recieve */
    IfxDma_ChannelId   txDmaChannelId;     /**< \brief DMA channel no for the Spi transmit */
    boolean            useDma;             /**< \brief use Dma for Data transfer/s */
} IfxQspi_SpiMaster_Dma;

/** \brief Dma configuration
 */
typedef struct
{
    IfxDma_ChannelId rxDmaChannelId;     /**< \brief DMA channel no for the Spi recieve */
    IfxDma_ChannelId txDmaChannelId;     /**< \brief DMA channel no for the Spi transmit */
    boolean          useDma;             /**< \brief use Dma for Data transfer/s */
} IfxQspi_SpiMaster_DmaConfig;

/** \brief Qspi Master Mode Error Flags
 */
typedef struct
{
    uint16 parityError : 1;            /**< \brief [0:0] Parity Error */
    uint16 configurationError : 1;     /**< \brief [1:1] Configuration Error */
    uint16 baudrateError : 1;          /**< \brief [2:2] baudrate Error */
    uint16 txFifoOverflowError : 1;    /**< \brief [3:3] TxFifo Overflow Error */
    uint16 txFifoUnderflowError : 1;   /**< \brief [4:4] TxFifo underflow Error */
    uint16 rxFifoOverflowError : 1;    /**< \brief [5:5] RxFifo Overflow Error */
    uint16 rxFifoUnderflowError : 1;   /**< \brief [6:6] RxFifo underflow Error */
    uint16 expectTimeoutError : 1;     /**< \brief [7:7] Expect Timeout Error */
} IfxQspi_SpiMaster_ErrorFlags;

/** \brief Union of Slave Select pins
 */
typedef union
{
    IfxQspi_SpiMaster_Input  input;      /**< \brief SLSI  pin configuration structure */
    IfxQspi_SpiMaster_Output output;     /**< \brief SLSO  pin configuration structure */
} IfxQspi_SpiMaster_InputOutput;

/** \brief Master pin IO configuration structure
 */
typedef struct
{
    const IfxQspi_Sclk_Out *sclk;          /**< \brief Pointer to SLCK out pin */
    IfxPort_OutputMode      sclkMode;      /**< \brief The SCLK pin output mode */
    const IfxQspi_Mtsr_Out *mtsr;          /**< \brief Pointer to MTSR out pin */
    IfxPort_OutputMode      mtsrMode;      /**< \brief The MTSR pin output mode */
    const IfxQspi_Mrst_In  *mrst;          /**< \brief Pointer to MRST in pin */
    IfxPort_InputMode       mrstMode;      /**< \brief The MRST pin input mode */
    IfxPort_PadDriver       pinDriver;     /**< \brief The pad driver mode which should be configured */
} IfxQspi_SpiMaster_Pins;

/** \} */

/** \addtogroup IfxLld_Qspi_SpiMaster_DataStructures
 * \{ */
/** \brief Module handle data structure
 */
typedef struct
{
    SpiIf                 base;     /**< \brief Module SPI interface handle */
    Ifx_QSPI             *qspi;     /**< \brief Pointer to QSPI module registers */
    IfxQspi_SpiMaster_Dma dma;      /**< \brief dma handle */
} IfxQspi_SpiMaster;

/** \brief Module Channel configuration structure
 */
typedef struct
{
    SpiIf_ChConfig                   base;               /**< \brief SPI interface channel configuration structure */
    IfxQspi_SpiMaster_InputOutput    sls;                /**< \brief Union of Slave Select pins */
    IfxQspi_SpiMaster_ChannelBasedCs channelBasedCs;     /**< \brief define the slso behaviour */
    IfxQspi_SpiMaster_Mode           mode;               /**< \brief Qspi Operating Mode */
} IfxQspi_SpiMaster_ChannelConfig;

/** \brief Module Channel handle structure
 */
struct IfxQspi_SpiMaster_Channel_s
{
    SpiIf_Ch                         base;                /**< \brief SPI interface channel handle structure */
    Ifx_QSPI_BACON                   bacon;               /**< \brief basic configuration register */
    IfxPort_Pin                      slso;                /**< \brief Defines SLSO pin */
    IfxQspi_SpiMaster_AutoSlso       activateSlso;        /**< \brief Specifies  function for Auto SLSO activation */
    IfxQspi_SpiMaster_AutoSlso       deactivateSlso;      /**< \brief Specifies  function for Auto SLSO deactivation */
    IfxQspi_ChannelId                channelId;           /**< \brief QSPI channel Number */
    Ifx_ActiveState                  slsoActiveState;     /**< \brief Specifies the current state of SLSO */
    uint8                            dataWidth;           /**< \brief Number of bits which will be written into the FIFO */
    boolean                          firstWrite;          /**< \brief Specifies whether the data id first write or not. */
    IfxQspi_SpiMaster_ChannelBasedCs channelBasedCs;      /**< \brief define the slso behaviour */
    IfxQspi_SpiMaster_Mode           mode;                /**< \brief Qspi Operating Mode */
    IfxQspi_SpiMaster_ErrorFlags     errorFlags;          /**< \brief Spi Master Error Flags */
};

/** \brief Module configuration structure
 */
typedef struct
{
    SpiIf_Config                  base;                           /**< \brief SPI interface configuration structure */
    Ifx_QSPI                     *qspi;                           /**< \brief Pointer to QSPI module registers */
    boolean                       allowSleepMode;                 /**< \brief Specifies module sleep mode */
    boolean                       pauseOnBaudrateSpikeErrors;     /**< \brief Specifies module pause on baudrate or spike errors */
    IfxQspi_PauseRunTransition    pauseRunTransition;             /**< \brief Specifies module run or pause mode */
    IfxQspi_TxFifoInt             txFifoThreshold;                /**< \brief Specifies the TXFIFO interrupt threshold */
    IfxQspi_RxFifoInt             rxFifoThreshold;                /**< \brief Specifies the RXFIFO interrupt threshold */
    const IfxQspi_SpiMaster_Pins *pins;                           /**< \brief structure for QSPI Master pins */
    IfxQspi_SpiMaster_DmaConfig   dma;                            /**< \brief Dma configuration */
} IfxQspi_SpiMaster_Config;

